mdbsliguo/stm32_template_SPL/Drivers/timer/timer_input_capture.c
/**
 * @file timer_input_capture.c
 * @brief 定时器输入捕获模块实现
 */

#include "timer_input_capture.h"
#include "board.h"
#include "config.h"
#include "error_handler.h"
#include "gpio.h"
#include "delay.h"
#include "nvic.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_tim.h"
#include "misc.h"
#include "system_stm32f10x.h"
#include <stdbool.h>
#include <stddef.h>

#if CONFIG_MODULE_TIMER_ENABLED

/* 定时器外设映射 */
static TIM_TypeDef *ic_tim_periphs[] = {
    TIM1,  /* IC_INSTANCE_TIM1 */
    TIM2,  /* IC_INSTANCE_TIM2 */
    TIM3,  /* IC_INSTANCE_TIM3 */
    TIM4,  /* IC_INSTANCE_TIM4 */
};

/* 定时器通道映射 */
static const uint16_t ic_tim_channels[] = {
    TIM_Channel_1,  /* IC_CHANNEL_1 */
    TIM_Channel_2,  /* IC_CHANNEL_2 */
    TIM_Channel_3,  /* IC_CHANNEL_3 */
    TIM_Channel_4,  /* IC_CHANNEL_4 */
};

/* 初始化标志 */
static bool g_ic_initialized[IC_INSTANCE_MAX][IC_CHANNEL_MAX] = {false};

/* 从模式标志（记录哪些实例使用了从模式） */
static bool g_ic_slave_mode[IC_INSTANCE_MAX] = {false};

/* 中断回调函数数组（暂时未使用，保留用于将来实现中断功能） */
/* 注释掉以避免编译警告，需要时再启用 */
/*
static IC_IT_Callback_t g_ic_it_callbacks[IC_INSTANCE_MAX][IC_CHANNEL_MAX][2] = {NULL};
static void *g_ic_it_user_data[IC_INSTANCE_MAX][IC_CHANNEL_MAX][2] = {NULL};
*/

/**
 * @brief 获取定时器外设时钟
 */
static uint32_t IC_GetPeriphClock(TIM_TypeDef *tim_periph)
{
    if (tim_periph == TIM1) return RCC_APB2Periph_TIM1;
    if (tim_periph == TIM2) return RCC_APB1Periph_TIM2;
    if (tim_periph == TIM3) return RCC_APB1Periph_TIM3;
    if (tim_periph == TIM4) return RCC_APB1Periph_TIM4;
    return 0;
}

/**
 * @brief 获取定时器实际时钟频率
 */
static uint32_t IC_GetTimerClock(TIM_TypeDef *tim_periph)
{
    uint32_t apb_clk;
    uint32_t tim_clk;
    
    SystemCoreClockUpdate();
    
    if (tim_periph == TIM1)
    {
        uint32_t apb2_prescaler = RCC->CFGR & RCC_CFGR_PPRE2;
        apb2_prescaler = (apb2_prescaler >> 11) & 0x07;
        
        if (apb2_prescaler < 4)
        {
            apb_clk = SystemCoreClock;
        }
        else
        {
            uint8_t presc_table[] = {0, 0, 0, 0, 1, 2, 3, 4};
            apb_clk = SystemCoreClock >> presc_table[apb2_prescaler];
        }
        
        if (apb2_prescaler >= 4)
        {
            tim_clk = apb_clk * 2;
        }
        else
        {
            tim_clk = apb_clk;
        }
    }
    else if (tim_periph == TIM2 || tim_periph == TIM3 || tim_periph == TIM4)
    {
        uint32_t apb1_prescaler = RCC->CFGR & RCC_CFGR_PPRE1;
        apb1_prescaler = (apb1_prescaler >> 8) & 0x07;
        
        if (apb1_prescaler < 4)
        {
            apb_clk = SystemCoreClock;
        }
        else
        {
            uint8_t presc_table[] = {0, 0, 0, 0, 1, 2, 3, 4};
            apb_clk = SystemCoreClock >> presc_table[apb1_prescaler];
        }
        
        if (apb1_prescaler >= 4)
        {
            tim_clk = apb_clk * 2;
        }
        else
        {
            tim_clk = apb_clk;
        }
    }
    else
    {
        return 0;
    }
    
    return tim_clk;
}

/**
 * @brief 获取GPIO引脚配置（需要根据定时器和通道确定）
 */
static void IC_GetGPIOConfig(IC_Instance_t instance, IC_Channel_t channel, 
                              GPIO_TypeDef **port, uint16_t *pin)
{
    *port = NULL;
    *pin = 0;
    
    if (instance == IC_INSTANCE_TIM1)
    {
        if (channel == IC_CHANNEL_1) { *port = GPIOA; *pin = GPIO_Pin_8; }
        else if (channel == IC_CHANNEL_2) { *port = GPIOA; *pin = GPIO_Pin_9; }
        else if (channel == IC_CHANNEL_3) { *port = GPIOA; *pin = GPIO_Pin_10; }
        else if (channel == IC_CHANNEL_4) { *port = GPIOA; *pin = GPIO_Pin_11; }
    }
    else if (instance == IC_INSTANCE_TIM2)
    {
        if (channel == IC_CHANNEL_1) { *port = GPIOA; *pin = GPIO_Pin_0; }
        else if (channel == IC_CHANNEL_2) { *port = GPIOA; *pin = GPIO_Pin_1; }
        else if (channel == IC_CHANNEL_3) { *port = GPIOA; *pin = GPIO_Pin_2; }
        else if (channel == IC_CHANNEL_4) { *port = GPIOA; *pin = GPIO_Pin_3; }
    }
    else if (instance == IC_INSTANCE_TIM3)
    {
        if (channel == IC_CHANNEL_1) { *port = GPIOA; *pin = GPIO_Pin_6; }
        else if (channel == IC_CHANNEL_2) { *port = GPIOA; *pin = GPIO_Pin_7; }
        else if (channel == IC_CHANNEL_3) { *port = GPIOB; *pin = GPIO_Pin_0; }
        else if (channel == IC_CHANNEL_4) { *port = GPIOB; *pin = GPIO_Pin_1; }
    }
    else if (instance == IC_INSTANCE_TIM4)
    {
        if (channel == IC_CHANNEL_1) { *port = GPIOB; *pin = GPIO_Pin_6; }
        else if (channel == IC_CHANNEL_2) { *port = GPIOB; *pin = GPIO_Pin_7; }
        else if (channel == IC_CHANNEL_3) { *port = GPIOB; *pin = GPIO_Pin_8; }
        else if (channel == IC_CHANNEL_4) { *port = GPIOB; *pin = GPIO_Pin_9; }
    }
}

/**
 * @brief 输入捕获初始化
 */
IC_Status_t IC_Init(IC_Instance_t instance, IC_Channel_t channel, IC_Polarity_t polarity)
{
    TIM_TypeDef *tim_periph;
    GPIO_TypeDef *gpio_port;
    uint16_t gpio_pin;
    uint16_t tim_channel;
    GPIO_InitTypeDef GPIO_InitStructure;
    TIM_ICInitTypeDef TIM_ICInitStructure;
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
    uint32_t gpio_clock;
    uint32_t tim_clock;
    
    /* ========== 参数校验 ========== */
    if (instance >= IC_INSTANCE_MAX) {
        return IC_ERROR_INVALID_INSTANCE;
    }
    if (channel >= IC_CHANNEL_MAX) {
        return IC_ERROR_INVALID_CHANNEL;
    }
    if (polarity > IC_POLARITY_BOTH) {
        return IC_ERROR_INVALID_PARAM;
    }
    
    /* 检查是否已初始化 */
    if (g_ic_initialized[instance][channel]) {
        return IC_ERROR_ALREADY_INITIALIZED;
    }
    
    tim_periph = ic_tim_periphs[instance];
    tim_channel = ic_tim_channels[channel];
    
    /* 获取GPIO配置 */
    IC_GetGPIOConfig(instance, channel, &gpio_port, &gpio_pin);
    if (gpio_port == NULL || gpio_pin == 0) {
        return IC_ERROR_INVALID_PERIPH;
    }
    
    /* ========== 1. 初始化 ========== */
    /* 1.1 RCC时钟使能 */
    if (gpio_port == GPIOA) gpio_clock = RCC_APB2Periph_GPIOA;
    else if (gpio_port == GPIOB) gpio_clock = RCC_APB2Periph_GPIOB;
    else if (gpio_port == GPIOC) gpio_clock = RCC_APB2Periph_GPIOC;
    else if (gpio_port == GPIOD) gpio_clock = RCC_APB2Periph_GPIOD;
    else return IC_ERROR_INVALID_PERIPH;
    
    RCC_APB2PeriphClockCmd(gpio_clock | RCC_APB2Periph_AFIO, ENABLE);
    
    tim_clock = IC_GetPeriphClock(tim_periph);
    if (tim_clock == 0) {
        return IC_ERROR_INVALID_PERIPH;
    }
    
    if (tim_periph == TIM1) {
        RCC_APB2PeriphClockCmd(tim_clock, ENABLE);
    } else {
        RCC_APB1PeriphClockCmd(tim_clock, ENABLE);
    }
    
    /* 1.2 GPIO配置成浮空输入模式 */
    GPIO_InitStructure.GPIO_Pin = gpio_pin;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(gpio_port, &GPIO_InitStructure);
    
