mdbsliguo/stm32_template_SPL/Drivers/timer/timer_input_capture.c
    /* 如果是PWMI模式，需要同时配置通道1和通道2的GPIO */
    if (polarity == IC_POLARITY_BOTH) {
        GPIO_TypeDef *gpio_port_other;
        uint16_t gpio_pin_other;
        
        /* 获取另一个通道的GPIO配置 */
        if (channel == IC_CHANNEL_1) {
            /* 通道1配置，需要配置通道2的GPIO */
            IC_GetGPIOConfig(instance, IC_CHANNEL_2, &gpio_port_other, &gpio_pin_other);
        } else if (channel == IC_CHANNEL_2) {
            /* 通道2配置，需要配置通道1的GPIO */
            IC_GetGPIOConfig(instance, IC_CHANNEL_1, &gpio_port_other, &gpio_pin_other);
        } else {
            gpio_port_other = NULL;
            gpio_pin_other = 0;
        }
        
        /* 配置另一个通道的GPIO（如果存在） */
        if (gpio_port_other != NULL && gpio_pin_other != 0) {
            /* 确保另一个通道的GPIO时钟已使能 */
            uint32_t gpio_clock_other;
            if (gpio_port_other == GPIOA) gpio_clock_other = RCC_APB2Periph_GPIOA;
            else if (gpio_port_other == GPIOB) gpio_clock_other = RCC_APB2Periph_GPIOB;
            else if (gpio_port_other == GPIOC) gpio_clock_other = RCC_APB2Periph_GPIOC;
            else if (gpio_port_other == GPIOD) gpio_clock_other = RCC_APB2Periph_GPIOD;
            else gpio_clock_other = 0;
            
            if (gpio_clock_other != 0) {
                RCC_APB2PeriphClockCmd(gpio_clock_other, ENABLE);
            }
            
            /* 配置另一个通道的GPIO为浮空输入模式 */
            GPIO_InitStructure.GPIO_Pin = gpio_pin_other;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
            GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
            GPIO_Init(gpio_port_other, &GPIO_InitStructure);
        }
    }
    
    /* ========== 2. 配置时基单元：让CNT计数器在内部时钟的驱动下自增运行 ========== */
    TIM_TimeBaseStructure.TIM_Period = 0xFFFF;
    TIM_TimeBaseStructure.TIM_Prescaler = 0;
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit(tim_periph, &TIM_TimeBaseStructure);
    
    /* ========== 3. 配置输入捕获单元 ========== */
    TIM_ICStructInit(&TIM_ICInitStructure);
    TIM_ICInitStructure.TIM_Channel = tim_channel;
    
    /* 3.1 极性 */
    TIM_ICInitStructure.TIM_ICPolarity = (polarity == IC_POLARITY_RISING) ? TIM_ICPolarity_Rising : 
                                         (polarity == IC_POLARITY_FALLING) ? TIM_ICPolarity_Falling : 
                                         TIM_ICPolarity_BothEdge;
    
    /* 3.2 直连通道/交叉通道 */
    TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
    
    /* 3.3 分频器参数 */
    TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
    
    /* 3.4 滤波器 */
    TIM_ICInitStructure.TIM_ICFilter = 0x0;
    
    /* 如果是PWM模式（双边沿），使用PWMI配置 */
    if (polarity == IC_POLARITY_BOTH) {
        TIM_PWMIConfig(tim_periph, &TIM_ICInitStructure);
        /* PWMI模式需要同时使能通道1和通道2 */
        /* 通道1捕获脉宽，通道2捕获周期（对于通道2配置） */
        /* 通道1捕获周期，通道2捕获脉宽（对于通道1配置） */
        if (tim_channel == TIM_Channel_1) {
            TIM_CCxCmd(tim_periph, TIM_Channel_1, TIM_CCx_Enable);
            TIM_CCxCmd(tim_periph, TIM_Channel_2, TIM_CCx_Enable);
        } else if (tim_channel == TIM_Channel_2) {
            TIM_CCxCmd(tim_periph, TIM_Channel_1, TIM_CCx_Enable);
            TIM_CCxCmd(tim_periph, TIM_Channel_2, TIM_CCx_Enable);
        } else {
            /* PWMI模式只支持通道1和通道2 */
            return IC_ERROR_INVALID_CHANNEL;
        }
        
        /* PWMI模式需要配置从模式（Slave Mode） */
        /* 配置从模式触发源：通道1使用TI1FP1，通道2使用TI2FP2 */
        uint16_t trigger_source;
        if (channel == IC_CHANNEL_1) {
            trigger_source = TIM_TS_TI1FP1;
        } else if (channel == IC_CHANNEL_2) {
            trigger_source = TIM_TS_TI2FP2;
        } else {
            return IC_ERROR_INVALID_CHANNEL;
        }
        TIM_SelectInputTrigger(tim_periph, trigger_source);
        
        /* 配置从模式为Reset：每次上升沿（周期捕获）时自动将CNT重置为0 */
        /* 这样可以直接读取CCR值得到周期，无需处理溢出 */
        TIM_SelectSlaveMode(tim_periph, TIM_SlaveMode_Reset);
        
        /* 标记为已初始化（使用从模式） */
        g_ic_initialized[instance][channel] = true;
        g_ic_slave_mode[instance] = true;
    } else {
        TIM_ICInit(tim_periph, &TIM_ICInitStructure);
        /* 普通输入捕获模式只使能指定通道 */
        TIM_CCxCmd(tim_periph, tim_channel, TIM_CCx_Enable);
        
        /* 标记为已初始化（不使用从模式） */
        g_ic_initialized[instance][channel] = true;
        g_ic_slave_mode[instance] = false;
    }
    
    return IC_OK;
}

/**
 * @brief 输入捕获初始化（使用从模式+Reset）
 */
IC_Status_t IC_InitWithSlaveMode(IC_Instance_t instance, IC_Channel_t channel, IC_Polarity_t polarity)
{
    TIM_TypeDef *tim_periph;
    GPIO_TypeDef *gpio_port;
    uint16_t gpio_pin;
    uint16_t tim_channel;
    GPIO_InitTypeDef GPIO_InitStructure;
    TIM_ICInitTypeDef TIM_ICInitStructure;
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
    uint32_t gpio_clock;
    uint32_t tim_clock;
    uint16_t trigger_source;
    
    /* ========== 参数校验 ========== */
    if (instance >= IC_INSTANCE_MAX) {
        return IC_ERROR_INVALID_INSTANCE;
    }
    if (channel >= IC_CHANNEL_MAX) {
        return IC_ERROR_INVALID_CHANNEL;
    }
    if (polarity > IC_POLARITY_BOTH) {
        return IC_ERROR_INVALID_PARAM;
    }
    
    /* 检查是否已初始化 */
    if (g_ic_initialized[instance][channel]) {
        return IC_ERROR_ALREADY_INITIALIZED;
    }
    
    tim_periph = ic_tim_periphs[instance];
    tim_channel = ic_tim_channels[channel];
    
    /* 获取GPIO配置 */
    IC_GetGPIOConfig(instance, channel, &gpio_port, &gpio_pin);
    if (gpio_port == NULL || gpio_pin == 0) {
        return IC_ERROR_INVALID_PERIPH;
    }
    
    /* ========== 1. 初始化 ========== */
    /* 1.1 RCC时钟使能 */
    if (gpio_port == GPIOA) gpio_clock = RCC_APB2Periph_GPIOA;
    else if (gpio_port == GPIOB) gpio_clock = RCC_APB2Periph_GPIOB;
    else if (gpio_port == GPIOC) gpio_clock = RCC_APB2Periph_GPIOC;
    else if (gpio_port == GPIOD) gpio_clock = RCC_APB2Periph_GPIOD;
    else return IC_ERROR_INVALID_PERIPH;
    
    RCC_APB2PeriphClockCmd(gpio_clock | RCC_APB2Periph_AFIO, ENABLE);
    
    tim_clock = IC_GetPeriphClock(tim_periph);
    if (tim_clock == 0) {
        return IC_ERROR_INVALID_PERIPH;
    }
    
    if (tim_periph == TIM1) {
        RCC_APB2PeriphClockCmd(tim_clock, ENABLE);
    } else {
        RCC_APB1PeriphClockCmd(tim_clock, ENABLE);
    }
    
    /* 1.2 GPIO配置成浮空输入模式 */
    GPIO_InitStructure.GPIO_Pin = gpio_pin;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(gpio_port, &GPIO_InitStructure);
    
    /* ========== 2. 配置时基单元：让CNT计数器在内部时钟的驱动下自增运行 ========== */
    TIM_TimeBaseStructure.TIM_Period = 0xFFFF;
    TIM_TimeBaseStructure.TIM_Prescaler = 0;
    TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit(tim_periph, &TIM_TimeBaseStructure);
    
    /* ========== 3. 配置输入捕获单元 ========== */
    TIM_ICStructInit(&TIM_ICInitStructure);
    TIM_ICInitStructure.TIM_Channel = tim_channel;
    
    /* 3.1 极性 */
    TIM_ICInitStructure.TIM_ICPolarity = (polarity == IC_POLARITY_RISING) ? TIM_ICPolarity_Rising : 
                                         (polarity == IC_POLARITY_FALLING) ? TIM_ICPolarity_Falling : 
                                         TIM_ICPolarity_BothEdge;
    
    /* 3.2 直连通道/交叉通道 */
    TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
    
