mdbsliguo/stm32_template_SPL/Drivers/timer/timer_input_capture.c
    /* 3.3 分频器参数 */
    TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
    
    /* 3.4 滤波器 */
    TIM_ICInitStructure.TIM_ICFilter = 0x0;
    
    /* 如果是PWM模式（双边沿），使用PWMI配置 */
    if (polarity == IC_POLARITY_BOTH) {
        TIM_PWMIConfig(tim_periph, &TIM_ICInitStructure);
        /* PWMI模式需要同时使能通道1和通道2 */
        /* 通道1捕获脉宽，通道2捕获周期（对于通道2配置） */
        /* 通道1捕获周期，通道2捕获脉宽（对于通道1配置） */
        if (tim_channel == TIM_Channel_1) {
            TIM_CCxCmd(tim_periph, TIM_Channel_1, TIM_CCx_Enable);
            TIM_CCxCmd(tim_periph, TIM_Channel_2, TIM_CCx_Enable);
        } else if (tim_channel == TIM_Channel_2) {
            TIM_CCxCmd(tim_periph, TIM_Channel_1, TIM_CCx_Enable);
            TIM_CCxCmd(tim_periph, TIM_Channel_2, TIM_CCx_Enable);
        } else {
            /* PWMI模式只支持通道1和通道2 */
            return IC_ERROR_INVALID_CHANNEL;
        }
    } else {
        TIM_ICInit(tim_periph, &TIM_ICInitStructure);
        /* 普通输入捕获模式只使能指定通道 */
        TIM_CCxCmd(tim_periph, tim_channel, TIM_CCx_Enable);
    }
    
    /* ========== 4. 从模式触发源 ========== */
    /* 根据通道选择触发源 */
    /* 注意：STM32标准外设库只支持通道1和通道2作为从模式触发源 */
    /* 通道3和通道4不支持作为从模式触发源，需要返回错误 */
    if (channel == IC_CHANNEL_1) {
        trigger_source = TIM_TS_TI1FP1;
    } else if (channel == IC_CHANNEL_2) {
        trigger_source = TIM_TS_TI2FP2;
    } else {
        /* 通道3和通道4不支持作为从模式触发源 */
        return IC_ERROR_INVALID_CHANNEL;
    }
    TIM_SelectInputTrigger(tim_periph, trigger_source);
    
    /* ========== 5. 选择触发之后执行操作（Reset） ========== */
    /* 使用Reset模式：每次捕获时自动将CNT重置为0 */
    TIM_SelectSlaveMode(tim_periph, TIM_SlaveMode_Reset);
    
    /* 标记为已初始化（使用从模式） */
    g_ic_initialized[instance][channel] = true;
    g_ic_slave_mode[instance] = true;
    
    return IC_OK;
}

/**
 * @brief 输入捕获反初始化
 */
IC_Status_t IC_Deinit(IC_Instance_t instance, IC_Channel_t channel)
{
    /* ========== 参数校验 ========== */
    if (instance >= IC_INSTANCE_MAX) {
        return IC_ERROR_INVALID_INSTANCE;
    }
    if (channel >= IC_CHANNEL_MAX) {
        return IC_ERROR_INVALID_CHANNEL;
    }
    
    /* ========== 占位空函数 ========== */
    /* 功能未实现，待完善 */
    
    return IC_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 启动输入捕获
 */
IC_Status_t IC_Start(IC_Instance_t instance, IC_Channel_t channel)
{
    TIM_TypeDef *tim_periph;
    uint16_t tim_channel;
    
    /* ========== 参数校验 ========== */
    if (instance >= IC_INSTANCE_MAX) {
        return IC_ERROR_INVALID_INSTANCE;
    }
    if (channel >= IC_CHANNEL_MAX) {
        return IC_ERROR_INVALID_CHANNEL;
    }
    
    /* 检查是否已初始化 */
    if (!g_ic_initialized[instance][channel]) {
        return IC_ERROR_NOT_INITIALIZED;
    }
    
    tim_periph = ic_tim_periphs[instance];
    tim_channel = ic_tim_channels[channel];
    
    /* 清除捕获标志 */
    if (channel == IC_CHANNEL_1) {
        TIM_ClearFlag(tim_periph, TIM_FLAG_CC1);
    } else if (channel == IC_CHANNEL_2) {
        TIM_ClearFlag(tim_periph, TIM_FLAG_CC2);
    } else if (channel == IC_CHANNEL_3) {
        TIM_ClearFlag(tim_periph, TIM_FLAG_CC3);
    } else if (channel == IC_CHANNEL_4) {
        TIM_ClearFlag(tim_periph, TIM_FLAG_CC4);
    }
    
    /* 确保输入捕获通道已使能（在Init中已使能，这里再次确认） */
    TIM_CCxCmd(tim_periph, tim_channel, TIM_CCx_Enable);
    
    /* ========== 6. 调用TIM_Cmd：开启定时器 ========== */
    TIM_Cmd(tim_periph, ENABLE);
    
    return IC_OK;
}

/**
 * @brief 停止输入捕获
 */
IC_Status_t IC_Stop(IC_Instance_t instance, IC_Channel_t channel)
{
    /* ========== 参数校验 ========== */
    if (instance >= IC_INSTANCE_MAX) {
        return IC_ERROR_INVALID_INSTANCE;
    }
    if (channel >= IC_CHANNEL_MAX) {
        return IC_ERROR_INVALID_CHANNEL;
    }
    
    /* ========== 占位空函数 ========== */
    /* 功能未实现，待完善 */
    
    return IC_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 读取捕获值
 */
IC_Status_t IC_ReadValue(IC_Instance_t instance, IC_Channel_t channel, uint32_t *value)
{
    /* ========== 参数校验 ========== */
    if (instance >= IC_INSTANCE_MAX) {
        return IC_ERROR_INVALID_INSTANCE;
    }
    if (channel >= IC_CHANNEL_MAX) {
        return IC_ERROR_INVALID_CHANNEL;
    }
    if (value == NULL) {
        return IC_ERROR_NULL_PTR;
    }
    
    /* ========== 占位空函数 ========== */
    /* 功能未实现，待完善 */
    
    return IC_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 测量频率
 */
IC_Status_t IC_MeasureFrequency(IC_Instance_t instance, IC_Channel_t channel, uint32_t *frequency, uint32_t timeout_ms)
{
    TIM_TypeDef *tim_periph;
    uint32_t timer_clock;
    uint32_t start_time;
    uint16_t capture1, capture2;
    uint64_t period_count_64;
    uint16_t flag;
    uint16_t tim_channel;
    
    /* ========== 参数校验 ========== */
    if (instance >= IC_INSTANCE_MAX) {
        return IC_ERROR_INVALID_INSTANCE;
    }
    if (channel >= IC_CHANNEL_MAX) {
        return IC_ERROR_INVALID_CHANNEL;
    }
    if (frequency == NULL) {
        return IC_ERROR_NULL_PTR;
    }
    
    /* 检查是否已初始化 */
    if (!g_ic_initialized[instance][channel]) {
        return IC_ERROR_NOT_INITIALIZED;
    }
    
    tim_periph = ic_tim_periphs[instance];
    tim_channel = ic_tim_channels[channel];
    timer_clock = IC_GetTimerClock(tim_periph);
    
    if (timer_clock == 0) {
        return IC_ERROR_INVALID_PERIPH;
    }
    
    /* 获取捕获标志位 */
    if (channel == IC_CHANNEL_1) flag = TIM_FLAG_CC1;
    else if (channel == IC_CHANNEL_2) flag = TIM_FLAG_CC2;
    else if (channel == IC_CHANNEL_3) flag = TIM_FLAG_CC3;
    else flag = TIM_FLAG_CC4;
    
    /* 确保定时器已启动 */
    if (!(tim_periph->CR1 & TIM_CR1_CEN)) {
        TIM_Cmd(tim_periph, ENABLE);
    }
    
    /* 确保输入捕获通道已使能 */
    TIM_CCxCmd(tim_periph, tim_channel, TIM_CCx_Enable);
    
    /* ========== 7. 需要读取频率时，直接读取CCR寄存器，按照FC/N，计算一下即可 ========== */
    
    /* 检查是否使用从模式 */
    if (g_ic_slave_mode[instance]) {
        /* 使用从模式+Reset：每次捕获自动将CNT重置为0，直接读取CCR即可得到周期计数 */
        /* 清除捕获标志 */
        TIM_ClearFlag(tim_periph, flag);
        
        /* 等待第一个上升沿（触发Reset，CNT被重置为0） */
        start_time = Delay_GetTick();
        while (!TIM_GetFlagStatus(tim_periph, flag)) {
            if (Delay_GetElapsed(Delay_GetTick(), start_time) > timeout_ms) {
                return IC_ERROR_TIMEOUT;
            }
        }
        
        /* 第一个上升沿触发Reset，CNT被重置为0，CCR也应该是0或很小的值 */
        /* 清除捕获标志，等待第二个上升沿 */
        TIM_ClearFlag(tim_periph, flag);
        start_time = Delay_GetTick();
        while (!TIM_GetFlagStatus(tim_periph, flag)) {
            if (Delay_GetElapsed(Delay_GetTick(), start_time) > timeout_ms) {
                return IC_ERROR_TIMEOUT;
            }
        }
        
        /* 读取第二个上升沿的捕获值（CCR寄存器） */
        /* 由于使用了Reset模式，CNT在第一个上升沿时被重置为0，第二个上升沿时CCR就是周期计数 */
        if (channel == IC_CHANNEL_1) capture2 = TIM_GetCapture1(tim_periph);
        else if (channel == IC_CHANNEL_2) capture2 = TIM_GetCapture2(tim_periph);
        else if (channel == IC_CHANNEL_3) capture2 = TIM_GetCapture3(tim_periph);
        else capture2 = TIM_GetCapture4(tim_periph);
        
        /* 计算频率：frequency = timer_clock / CCR (FC/N) */
        if (capture2 == 0) {
            return IC_ERROR_INVALID_PARAM;
        }
        
        *frequency = timer_clock / capture2;
    } else {
        /* 不使用从模式：使用测周法，需要等待两个上升沿并统计溢出次数 */
        /* 清除捕获标志 */
        TIM_ClearFlag(tim_periph, flag);
        
