mdbsliguo/stm32_template_SPL/Drivers/timer/timer_input_capture.c
        /* 等待第一个上升沿 */
        start_time = Delay_GetTick();
        while (!TIM_GetFlagStatus(tim_periph, flag)) {
            if (Delay_GetElapsed(Delay_GetTick(), start_time) > timeout_ms) {
                return IC_ERROR_TIMEOUT;
            }
        }
        
        /* 清除溢出标志，准备统计溢出 */
        TIM_ClearFlag(tim_periph, TIM_FLAG_Update);
        
        /* 读取第一个捕获值 */
        if (channel == IC_CHANNEL_1) capture1 = TIM_GetCapture1(tim_periph);
        else if (channel == IC_CHANNEL_2) capture1 = TIM_GetCapture2(tim_periph);
        else if (channel == IC_CHANNEL_3) capture1 = TIM_GetCapture3(tim_periph);
        else capture1 = TIM_GetCapture4(tim_periph);
        
        /* 读取第一个CNT值（用于溢出检测） */
        uint16_t cnt1_first = tim_periph->CNT;
        
        /* 清除捕获标志，等待第二个上升沿 */
        TIM_ClearFlag(tim_periph, flag);
        start_time = Delay_GetTick();
        
        /* 统计溢出次数，使用CNT寄存器检测溢出 */
        uint32_t overflow_count = 0;
        uint16_t last_cnt = cnt1_first;
        uint32_t actual_wait_time_ms = 0;
        
        while (!TIM_GetFlagStatus(tim_periph, flag)) {
            uint16_t current_cnt = tim_periph->CNT;
            
            /* 检查定时器溢出：CNT从大值跳回小值（或接近0） */
            /* 注意：需要考虑CNT可能从65535跳回0，或者从任意值跳回更小的值 */
            if (current_cnt < last_cnt) {
                /* CNT减小，说明发生了溢出 */
                overflow_count++;
            }
            last_cnt = current_cnt;
            
            /* 检查定时器溢出标志（备用方法，但主要依赖CNT检测） */
            if (TIM_GetFlagStatus(tim_periph, TIM_FLAG_Update)) {
                TIM_ClearFlag(tim_periph, TIM_FLAG_Update);
            }
            
            /* 检查超时并记录实际等待时间 */
            actual_wait_time_ms = Delay_GetElapsed(Delay_GetTick(), start_time);
            if (actual_wait_time_ms > timeout_ms) {
                return IC_ERROR_TIMEOUT;
            }
            
            /* 对于低频信号（如1Hz），如果等待时间已经超过500ms，使用时间估算方法 */
            /* 这样可以避免溢出统计不准确的问题 */
            if (actual_wait_time_ms > 500 && overflow_count == 0) {
                /* 等待时间已经超过500ms，但溢出次数为0，说明可能漏掉了溢出 */
                /* 使用时间估算：每65536个计数对应一次溢出 */
                /* 估算溢出次数 = (timer_clock * elapsed_ms / 1000) / 65536 */
                uint64_t estimated_overflow = ((uint64_t)timer_clock * actual_wait_time_ms) / (1000ULL * 0x10000ULL);
                if (estimated_overflow > 0) {
                    overflow_count = (uint32_t)estimated_overflow;
                }
            }
        }
        
        /* 记录最终实际等待时间 */
        actual_wait_time_ms = Delay_GetElapsed(Delay_GetTick(), start_time);
        
        /* 读取第二个捕获值 */
        if (channel == IC_CHANNEL_1) capture2 = TIM_GetCapture1(tim_periph);
        else if (channel == IC_CHANNEL_2) capture2 = TIM_GetCapture2(tim_periph);
        else if (channel == IC_CHANNEL_3) capture2 = TIM_GetCapture3(tim_periph);
        else capture2 = TIM_GetCapture4(tim_periph);
        
        /* 读取第二个CNT值（用于验证） */
        uint16_t cnt2_last = tim_periph->CNT;
        
        /* 计算周期（考虑多次溢出） */
        /* 使用64位计算避免溢出 */
        if (capture2 >= capture1) {
            /* capture2 >= capture1：可能没有溢出，或溢出后继续计数 */
            period_count_64 = (uint64_t)overflow_count * 0x10000ULL + (capture2 - capture1);
        } else {
            /* capture2 < capture1：至少发生了一次溢出（最后一次） */
            /* 如果overflow_count == 0，说明在读取capture2之前发生了溢出但未检测到 */
            if (overflow_count == 0) {
                overflow_count = 1;  /* 至少发生了一次溢出 */
            }
            period_count_64 = (uint64_t)overflow_count * 0x10000ULL - capture1 + capture2;
        }
        
        /* 验证：如果CNT也发生了溢出，应该与capture的溢出一致 */
        /* 如果cnt2_last < cnt1_first，说明CNT也发生了溢出，应该与overflow_count一致 */
        if (cnt2_last < cnt1_first && overflow_count == 0) {
            /* CNT发生了溢出，但overflow_count为0，说明溢出检测有问题 */
            /* 至少应该有一次溢出 */
            overflow_count = 1;
            /* 重新计算周期 */
            if (capture2 >= capture1) {
                period_count_64 = 0x10000ULL + (capture2 - capture1);
            } else {
                period_count_64 = 0x10000ULL - capture1 + capture2;
            }
        }
        
        /* 计算频率 */
        if (period_count_64 == 0) {
            return IC_ERROR_INVALID_PARAM;
        }
        
        /* 使用64位除法计算频率，避免精度损失 */
        /* 对于1Hz信号，period_count_64应该约等于timer_clock */
        /* 如果period_count_64 > timer_clock * 2，说明溢出次数统计过多，需要修正 */
        /* 或者如果实际等待时间 > 500ms，使用时间估算方法更准确（适用于低频信号） */
        if (period_count_64 > ((uint64_t)timer_clock * 2) || actual_wait_time_ms > 500) {
            /* 溢出次数统计不准确，或等待时间较长，使用实际等待时间来估算周期 */
            if (actual_wait_time_ms > 0) {
                /* 使用实际等待时间来计算周期 */
                /* period_count_64 = timer_clock * actual_wait_time_ms / 1000 */
                period_count_64 = ((uint64_t)timer_clock * actual_wait_time_ms) / 1000ULL;
            } else {
                /* 如果actual_wait_time_ms为0，使用capture值的差值 */
                uint64_t min_period;
                if (capture2 >= capture1) {
                    min_period = capture2 - capture1;
                } else {
                    min_period = 0x10000ULL - capture1 + capture2;
                }
                /* 如果min_period太小，说明发生了溢出，至少加一次溢出 */
                if (min_period < 1000) {
                    period_count_64 = 0x10000ULL + min_period;
                } else {
                    period_count_64 = min_period;
                }
            }
        }
        
        /* 再次检查period_count_64是否为0 */
        if (period_count_64 == 0) {
            return IC_ERROR_INVALID_PARAM;
        }
        
        /* 使用64位除法计算频率，避免精度损失 */
        *frequency = (uint32_t)((uint64_t)timer_clock / period_count_64);
    }
    
    return IC_OK;
}

/**
 * @brief 测量频率（测频法，适用于高频信号）
 * @note 测频法：在固定时间内计数脉冲数量（上升沿），然后计算频率 f = count / time
 */
IC_Status_t IC_MeasureFrequencyByCount(IC_Instance_t instance, IC_Channel_t channel, uint32_t *frequency, uint32_t gate_time_ms)
{
    TIM_TypeDef *tim_periph;
    uint32_t start_time;
    uint32_t gate_start_time;
    uint32_t pulse_count;
    uint16_t flag;
    uint16_t tim_channel;
    
