mdbsliguo/stm32_template_SPL/Drivers/timer/timer_input_capture.c
    /* ========== 参数校验 ========== */
    if (instance >= IC_INSTANCE_MAX) {
        return IC_ERROR_INVALID_INSTANCE;
    }
    if (channel >= IC_CHANNEL_MAX) {
        return IC_ERROR_INVALID_CHANNEL;
    }
    if (frequency == NULL) {
        return IC_ERROR_NULL_PTR;
    }
    if (gate_time_ms == 0) {
        return IC_ERROR_INVALID_PARAM;
    }
    
    /* 检查是否已初始化 */
    if (!g_ic_initialized[instance][channel]) {
        return IC_ERROR_NOT_INITIALIZED;
    }
    
    tim_periph = ic_tim_periphs[instance];
    tim_channel = ic_tim_channels[channel];
    
    /* 获取捕获标志位 */
    if (channel == IC_CHANNEL_1) flag = TIM_FLAG_CC1;
    else if (channel == IC_CHANNEL_2) flag = TIM_FLAG_CC2;
    else if (channel == IC_CHANNEL_3) flag = TIM_FLAG_CC3;
    else flag = TIM_FLAG_CC4;
    
    /* 确保定时器已启动 */
    if (!(tim_periph->CR1 & TIM_CR1_CEN)) {
        TIM_Cmd(tim_periph, ENABLE);
    }
    
    /* 确保输入捕获通道已使能 */
    TIM_CCxCmd(tim_periph, tim_channel, TIM_CCx_Enable);
    
    /* 清除捕获标志 */
    TIM_ClearFlag(tim_periph, flag);
    
    /* 等待第一个上升沿作为起始点 */
    start_time = Delay_GetTick();
    while (!TIM_GetFlagStatus(tim_periph, flag)) {
        if (Delay_GetElapsed(Delay_GetTick(), start_time) > gate_time_ms) {
            return IC_ERROR_TIMEOUT;
        }
    }
    
    /* 清除捕获标志，开始计数 */
    TIM_ClearFlag(tim_periph, flag);
    pulse_count = 0;  /* 从0开始计数，第一个上升沿作为同步点，不计入 */
    gate_start_time = Delay_GetTick();  /* 记录闸门开始时间 */
    
    /* 在闸门时间内计数脉冲（上升沿） */
    /* 注意：使用精确的时间控制，确保在gate_time_ms时间内计数 */
    /* 对于高频信号，需要快速循环检查捕获标志，避免错过上升沿 */
    uint32_t gate_end_time = gate_start_time + gate_time_ms;
    while (Delay_GetTick() < gate_end_time) {
        /* 快速检查捕获标志（上升沿） */
        if (TIM_GetFlagStatus(tim_periph, flag)) {
            pulse_count++;
            /* 立即清除捕获标志，准备捕获下一个上升沿 */
            TIM_ClearFlag(tim_periph, flag);
        }
        /* 注意：不要在这里添加延时，保持循环尽可能快 */
    }
    
    /* 计算实际经过的时间（毫秒） */
    uint32_t actual_time_ms = Delay_GetElapsed(Delay_GetTick(), gate_start_time);
    if (actual_time_ms == 0) {
        actual_time_ms = 1;  /* 避免除零 */
    }
    
    /* 计算频率：f = count / time (Hz) */
    if (pulse_count == 0) {
        return IC_ERROR_INVALID_PARAM;
    }
    
    *frequency = (pulse_count * 1000) / actual_time_ms;
    
    return IC_OK;
}

/**
 * @brief 测量PWM信号
 */
IC_Status_t IC_MeasurePWM(IC_Instance_t instance, IC_Channel_t channel, IC_MeasureResult_t *result, uint32_t timeout_ms)
{
    TIM_TypeDef *tim_periph;
    uint32_t timer_clock;
    uint32_t start_time;
    uint32_t period_count, pulse_width_count;
    uint32_t period_us, pulse_width_us;
    
    /* ========== 参数校验 ========== */
    if (instance >= IC_INSTANCE_MAX) {
        return IC_ERROR_INVALID_INSTANCE;
    }
    if (channel >= IC_CHANNEL_MAX) {
        return IC_ERROR_INVALID_CHANNEL;
    }
    if (result == NULL) {
        return IC_ERROR_NULL_PTR;
    }
    
    /* 检查是否已初始化（PWM模式需要IC_POLARITY_BOTH） */
    if (!g_ic_initialized[instance][channel]) {
        return IC_ERROR_NOT_INITIALIZED;
    }
    
    tim_periph = ic_tim_periphs[instance];
    timer_clock = IC_GetTimerClock(tim_periph);
    
    if (timer_clock == 0) {
        return IC_ERROR_INVALID_PERIPH;
    }
    
    /* PWMI模式：需要同时使用通道1和通道2 */
    /* 对于通道1配置：通道1捕获周期（上升沿），通道2捕获脉宽（下降沿） */
    /* 对于通道2配置：通道2捕获周期（上升沿），通道1捕获脉宽（下降沿） */
    /* 
     * PWMI模式工作原理（使用从模式+Reset）：
     * - 配置从模式为Reset，触发源为周期通道的上升沿
     * - 当周期通道捕获到上升沿时，CNT自动复位为0
     * - 通道2（直接输入，上升沿）：捕获周期（两个上升沿之间的时间，CNT自动复位）
     * - 通道1（间接输入，下降沿）：捕获脉宽（上升沿到下降沿的时间）
     * 
     * 对于通道2配置：
     * - 通道2（直接输入，上升沿）：捕获周期，触发CNT复位
     * - 通道1（间接输入，下降沿）：捕获脉宽
     * 
     * 正确的读取方法（使用从模式+Reset）：
     * 1. 等待周期通道的上升沿（完成一个完整周期，CNT自动复位为0）
     * 2. 此时可以直接读取周期通道的CCR值得到周期（因为CNT已复位）
     * 3. 读取脉宽通道的CCR值得到脉宽（应该是当前周期的脉宽）
     */
    if (channel == IC_CHANNEL_1) {
        /* 清除标志位，准备新的捕获 */
        TIM_ClearFlag(tim_periph, TIM_FLAG_CC1);
        TIM_ClearFlag(tim_periph, TIM_FLAG_CC2);
        
        /* 等待周期捕获完成（通道1上升沿，CNT自动复位为0） */
        start_time = Delay_GetTick();
        while (!TIM_GetFlagStatus(tim_periph, TIM_FLAG_CC1)) {
            if (Delay_GetElapsed(Delay_GetTick(), start_time) > timeout_ms) {
                return IC_ERROR_TIMEOUT;
            }
        }
        
        /* 读取周期和脉宽（通道1捕获周期，通道2捕获脉宽） */
        /* 使用从模式+Reset，CNT已自动复位，直接读取CCR即可 */
        period_count = TIM_GetCapture1(tim_periph);
        pulse_width_count = TIM_GetCapture2(tim_periph);
        
        /* 清除标志位，准备下次测量 */
        TIM_ClearFlag(tim_periph, TIM_FLAG_CC1);
        TIM_ClearFlag(tim_periph, TIM_FLAG_CC2);
    } else if (channel == IC_CHANNEL_2) {
        /* 清除标志位，准备新的捕获 */
        TIM_ClearFlag(tim_periph, TIM_FLAG_CC1);
        TIM_ClearFlag(tim_periph, TIM_FLAG_CC2);
        
        /* PWMI模式读取流程（通道2配置，使用从模式+Reset）：
         * 在一个周期中：
         * 1. 信号从低到高（上升沿）→ 通道2捕获周期，CNT复位为0
         * 2. 信号从高到低（下降沿）→ 通道1捕获脉宽
         * 
         * 使用从模式+Reset时：
         * - 当通道2捕获到上升沿时，CNT自动复位为0
         * - 此时通道1的值应该是上一个周期的脉宽（因为下降沿在上升沿之前发生）
         * 
         * 正确的读取方法（参考标准PWMI配置）：
         * 1. 等待通道1的下降沿（脉宽捕获，当前周期的脉宽）
         * 2. 读取脉宽值
         * 3. 等待通道2的上升沿（周期捕获，CNT复位，当前周期的周期）
         * 4. 读取周期值
         * 这样确保读取的是同一个周期的数据
         */
        
        /* 等待脉宽捕获完成（通道1下降沿，当前周期的脉宽） */
        start_time = Delay_GetTick();
        while (!TIM_GetFlagStatus(tim_periph, TIM_FLAG_CC1)) {
            if (Delay_GetElapsed(Delay_GetTick(), start_time) > timeout_ms) {
                return IC_ERROR_TIMEOUT;
            }
        }
        
        /* 读取脉宽值（通道1捕获脉宽） */
        pulse_width_count = TIM_GetCapture1(tim_periph);
        
        /* 清除通道1标志位 */
        TIM_ClearFlag(tim_periph, TIM_FLAG_CC1);
        
        /* 等待周期捕获完成（通道2上升沿，CNT自动复位为0，当前周期的周期） */
        start_time = Delay_GetTick();
        while (!TIM_GetFlagStatus(tim_periph, TIM_FLAG_CC2)) {
            if (Delay_GetElapsed(Delay_GetTick(), start_time) > timeout_ms) {
                return IC_ERROR_TIMEOUT;
            }
        }
        
        /* 读取周期值（通道2捕获周期） */
        /* 使用从模式+Reset，CNT已自动复位，直接读取CCR即可 */
        period_count = TIM_GetCapture2(tim_periph);
        
